containernet> s1 vtysh

Hello, this is Quagga (version 1.2.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

s1# conf t
s1(config)# router bgp 6500
s1(config-router)#  ^?^C^C

s1(config-router)# neighbour ^?^C^C

s1(config-router)# neighbor 10.0.0.2 remote-as 6500
s1(config-router)# network 10.1.0.0 mask 255.255.255.0
s1(config-router)# network 10.2.0.0 mask 255.255.255.0
s1(config-router)# network 10.0.0.2
s1(config-router)# bg^C^C

s1(config-router)# show bgp summary^C^C

s1(config-router)# bgp summary
% Unknown command.
s1(config-router)# show bgp summary
% Unknown command.
s1(config-router)# show ip bgp
% Unknown command.
s1(config-router)# exit
s1(config)# show ip bgp
% Unknown command.
s1(config)# exit
s1# show ip bgp
BGP table version is 0, local router ID is 192.168.19.2
Status codes: s suppressed, d damped, h history, * valid, > best, = multipath,
              i internal, r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 10.0.0.0         0.0.0.0                  0         32768 i
*> 10.1.0.0/24      0.0.0.0                  0         32768 i
*> 10.2.0.0/24      0.0.0.0                  0         32768 i

Displayed  3 out of 3 total prefixes
s1# exit
containernet> s2 vtysh

Hello, this is Quagga (version 1.2.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

s2# conf t
s2(config)# router bgp 5^C^C

s2(config)# router bgp 6500
s2(config-router)# neighbor 10.0.0.1 remote-as 6500
s2(config-router)# network 10.3.0.0 mask 255.255.255.0
s2(config-router)# network 10.4.0.0 mask 255.1^?^C^C

s2(config-router)# network 10.4.0.0 mask 255.255.255.0
s2(config-router)# network 10.0.0.1
s2(config-router)# exit
s2(config)# exit
s2# show ip bgp
BGP table version is 0, local router ID is 192.168.19.3
Status codes: s suppressed, d damped, h history, * valid, > best, = multipath,
              i internal, r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 10.0.0.0         0.0.0.0                  0         32768 i
* i                 10.0.0.1                 0    100      0 i
*>i10.1.0.0/24      10.0.0.1                 0    100      0 i
*>i10.2.0.0/24      10.0.0.1                 0    100      0 i
*> 10.3.0.0/24      0.0.0.0                  0         32768 i
*> 10.4.0.0/24      0.0.0.0                  0         32768 i

Displayed  5 out of 6 total prefixes
s2# exit
containernet> s1 vtysh

Hello, this is Quagga (version 1.2.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

s1# show ip bgp
BGP table version is 0, local router ID is 192.168.19.2
Status codes: s suppressed, d damped, h history, * valid, > best, = multipath,
              i internal, r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
* i10.0.0.0         10.0.0.2                 0    100      0 i
*>                  0.0.0.0                  0         32768 i
*> 10.1.0.0/24      0.0.0.0                  0         32768 i
*> 10.2.0.0/24      0.0.0.0                  0         32768 i
*>i10.3.0.0/24      10.0.0.2                 0    100      0 i
*>i10.4.0.0/24      10.0.0.2                 0    100      0 i

